drop proc if exists sel_course_check
create procedure sel_course_check
    @student_id varchar(20)
as
begin
    declare @name nvarchar(15), @cnt int
    declare stu_cs cursor local scroll for
    select name from student where id = @student_id
    open stu_cs
    fetch next from stu_cs into @name
    if @@FETCH_STATUS = 0 begin
        select @cnt=count(1) from student_course where student_id = @student_id
        if @cnt > 3 begin
            select @name + N'，已经完成了选课' as result
        end
        else begin
            select @name + N'，还需选课' as result
        end
        -- select @name + N'选了' +
        --     convert(varchar(19), @cnt) + N'门课' as result
    end
    else begin
        select N'Fetch状态: ' + convert(varchar(19), @@FETCH_STATUS) + N', 指定学生不存在' as result
    end
end
execute sel_course_check 'g0940207'
/*
+--------------------------+
|          result          |
+--------------------------+
| 李红[小]，已经完成了选课 |
+--------------------------+
*/
drop proc if exists show_tea
create procedure show_tea
as
begin
    declare @teacher_id varchar(20)
    declare @teacher_name nvarchar(20)
    declare @teacher_gender nvarchar(2)
    declare @teacher_prof nvarchar(5)
    declare stu_cs cursor local scroll for
    select id, name, gender, prof from teacher
    open stu_cs
    fetch next from stu_cs into @teacher_id, @teacher_name, @teacher_gender, @teacher_prof
    while @@FETCH_STATUS = 0 begin
        select @teacher_id, @teacher_name as name, @teacher_gender as gender, @teacher_prof as prof
        select course_id, name from teacher_course
            left join course on course_id = course.id where teacher_id=@teacher_id
        fetch next from stu_cs into @teacher_id, @teacher_name, @teacher_gender, @teacher_prof
    end
end
execute show_tea
/*
+-----------+--------+--------+--------+
|           |  name  | gender |  prof  |
+-----------+--------+--------+--------+
| dep01_001 | 王敬远 |   男   | 副教授 |
+-----------+--------+--------+--------+
+------------+----------------+
| course_id  |      name      |
+------------+----------------+
| dep01_s002 | 网络技术与实践 |
| dep01_s002 | 网络技术与实践 |
+------------+----------------+
+-----------+------+--------+--------+
|           | name | gender |  prof  |
+-----------+------+--------+--------+
| dep01_002 | 马丽 |   女   | 副教授 |
+-----------+------+--------+--------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+--------+
|           | name | gender |  prof  |
+-----------+------+--------+--------+
| dep01_003 | 包维 |   女   | 副教授 |
+-----------+------+--------+--------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+--------+--------+------+
|           |  name  | gender | prof |
+-----------+--------+--------+------+
| dep01_004 | 蒋晓英 |   女   | 讲师 |
+-----------+--------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep01_005 | 黄翔 |   男   | 讲师 |
+-----------+------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+--------+--------+------+
|           |  name  | gender | prof |
+-----------+--------+--------+------+
| dep01_025 | 周春桃 |   女   | 教授 |
+-----------+--------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep02_001 | 康辉 |   男   | 教授 |
+-----------+------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep02_002 | 王皓 |   男   | 讲师 |
+-----------+------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+--------+--------+------+
|           |  name  | gender | prof |
+-----------+--------+--------+------+
| dep02_003 | 李丽华 |   女   | 讲师 |
+-----------+--------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep02_004 | 罗伟 |   男   | 讲师 |
+-----------+------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+--------+--------+--------+
|           |  name  | gender |  prof  |
+-----------+--------+--------+--------+
| dep03_001 | 董一平 |   男   | 副教授 |
+-----------+--------+--------+--------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep03_002 | 潘惠 |   女   | 讲师 |
+-----------+------+--------+------+
+-----------+------+
| course_id | name |
+-----------+------+
+-----------+------+
+-----------+------+--------+--------+
|           | name | gender |  prof  |
+-----------+------+--------+--------+
| dep04_001 | 纪云 |   男   | 副教授 |
+-----------+------+--------+--------+
+------------+--------------------------+
| course_id  |           name           |
+------------+--------------------------+
| dep04_s001 | SQL Server数据库开发技术 |
| dep04_s005 |         网页设计         |
+------------+--------------------------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep04_002 | 章红 |   女   | 教授 |
+-----------+------+--------+------+
+------------+--------------------+
| course_id  |        name        |
+------------+--------------------+
| dep04_p001 |   C语言程序设计    |
| dep04_s002 | JAVA程序设计与开发 |
+------------+--------------------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep04_003 | 李伟 |   男   | 教授 |
+-----------+------+--------+------+
+------------+--------------+
| course_id  |     name     |
+------------+--------------+
| dep04_s003 |  单片机原理  |
| dep04_s004 | 软件开发技术 |
+------------+--------------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep04_004 | 严为 |   男   | 助教 |
+-----------+------+--------+------+
+------------+--------------+
| course_id  |     name     |
+------------+--------------+
| dep04_b001 |  计算机基础  |
| dep04_s004 | 软件开发技术 |
+------------+--------------+
+-----------+------+--------+------+
|           | name | gender | prof |
+-----------+------+--------+------+
| dep04_005 | 乔红 |   女   | 讲师 |
+-----------+------+--------+------+
+------------+--------------------------+
| course_id  |           name           |
+------------+--------------------------+
| dep04_s001 | SQL Server数据库开发技术 |
+------------+--------------------------+
*/
